Revit 2024 API
NumberSystem.NumberOrientation Property
 The number orientation of number system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public TagOrientation NumberOrientation { get; set; }
Visual Basic
Public Property NumberOrientation As TagOrientation
	Get
	Set
Visual C++
public:
property TagOrientation NumberOrientation {
	TagOrientation get ();
	void set (TagOrientation value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: Orientation AnyModelDirection is not supported -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace